Documents/ЗаказМатериаловВПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>ЗаказМатериаловВПроизводство</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтгружатьЧастями</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотреблениеДляДеятельности</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеховаяКладовая</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовМатериаловВПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДлительностьПеремещения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДатаОтгрузки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДатаПоступления</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьПеремещения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГИГ_СхемаОбеспечения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СхемыОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГИГ_СрокПоставки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отменено</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОбеспечения</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеПоступления</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоОтгрузки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаПродукции</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусыЗаказовМатериаловВПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовМатериаловВПроизводство</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЭтаповПроизводства2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>СтатусыЭтаповПроизводства2_2</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Формируется</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сформирован</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Начат</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыОбеспечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>ВариантыОбеспечения</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Требуется</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзЗаказов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обособленно</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоСклада</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузитьОбособленно</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузить</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеТребуется</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказМатериаловВПроизводство/Ext/ObjectModule.bsl
&После("ПередЗаписью")
Процедура Рин1_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если не ЭтотОбъект.Ссылка.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказМатериаловВПроизводствоТовары.Назначение.Заказ КАК НазначениеЗаказ
		|ПОМЕСТИТЬ ВТ_Этапы
		|ИЗ
		|	Документ.ЗаказМатериаловВПроизводство.Товары КАК ЗаказМатериаловВПроизводствоТовары
		|ГДЕ
		|	ЗаказМатериаловВПроизводствоТовары.Ссылка = &Ссылка
		|	И НЕ ЗаказМатериаловВПроизводствоТовары.Ссылка.Статус = ЗНАЧЕНИЕ(перечисление.СтатусыЗаказовМатериаловВПроизводство.закрыт)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказМатериаловВПроизводствоТовары.Назначение.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Этапы.НазначениеЗаказ КАК НазначениеЗаказ
		|ИЗ
		|	ВТ_Этапы КАК ВТ_Этапы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
		|		ПО ВТ_Этапы.НазначениеЗаказ = ЭтапПроизводства2_2.Ссылка
		|ГДЕ
		|	НЕ ЭтапПроизводства2_2.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Формируется)
		|	И НЕ ЭтапПроизводства2_2.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен)
		|	И ЭтапПроизводства2_2.Проведен";
		
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		ТЗ_Этапы = РезультатЗапроса.Выгрузить();
		
		//сгруппируем строки тч товары
		ТЗ_Товары = ЭтотОбъект.Товары.Выгрузить(,"Номенклатура,Характеристика,Назначение,Количество,Отменено");
		ТЗ_Товары.Свернуть("Номенклатура,Характеристика,Назначение,Отменено","Количество");
			
		//соберем таблицу сверх заказа и выведем сообщения
		Для каждого СтрокаТЧ Из ТЗ_Товары Цикл
			Если СтрокаТЧ.Отменено или СтрокаТЧ.Назначение.Заказ = Справочники.Назначения.ПустаяСсылка() Тогда
				Продолжить;
			КонецЕсли;
			НайденныйЭтап = ТЗ_Этапы.Найти(СтрокаТЧ.Назначение.Заказ,);
			Если не НайденныйЭтап = Неопределено Тогда
				
				стр_ОтборСтрок =  Новый Структура();
				стр_ОтборСтрок.Вставить("Номенклатура",СтрокаТЧ.Номенклатура);
				стр_ОтборСтрок.Вставить("Характеристика",СтрокаТЧ.Характеристика);
				стр_ОтборСтрок.Вставить("ВариантОбеспечения",Перечисления.ВариантыОбеспечения.Обособленно);
				МассивСтрок = НайденныйЭтап.НазначениеЗаказ.ОбеспечениеМатериаламиИРаботами.НайтиСтроки(стр_ОтборСтрок);
				Если не МассивСтрок.Количество() = 0 Тогда
					КоличествоНоменклатуры_Этап = 0;
					Для каждого СтрокаМассива Из МассивСтрок Цикл
						КоличествоНоменклатуры_Этап = КоличествоНоменклатуры_Этап + СтрокаМассива.Количество; 
					КонецЦикла;
				КонецЕсли;
				
				Если СтрокаТЧ.Количество > КоличествоНоменклатуры_Этап Тогда
					
					//Из таблицы сверхзаказа добавим в тч документа новые строки со снятым назначением
					НоваяСтрТовары = ЭтотОбъект.Товары.Добавить();
					НоваяСтрТовары.Номенклатура = СтрокаТЧ.Номенклатура;
					НоваяСтрТовары.Характеристика = СтрокаТЧ.Характеристика;
					НоваяСтрТовары.Назначение = Справочники.Назначения.ПустаяСсылка();
					Количество = СтрокаТЧ.Количество - КоличествоНоменклатуры_Этап;
					НоваяСтрТовары.Количество = Количество;
					НоваяСтрТовары.КоличествоУпаковок = Количество;
					НоваяСтрТовары.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Требуется;
					НоваяСтрТовары.НачалоОтгрузки = ТекущаяДата(); 
					НоваяСтрТовары.ОкончаниеПоступления = ТекущаяДата() + ДлительностьПеремещения*86400;
					
					//сообщим о сверхзаказе
					ОбщегоНазначения.СообщитьПользователю("Строка сверх потребности: " + НоваяСтрТовары.Номенклатура + "/" + НоваяСтрТовары.Характеристика + "/" + СтрокаТЧ.Назначение + " / количеством - " + НоваяСтрТовары.Количество);
					
					//найдем строку в тч товары документа с таким же товаром или несколько - отсортируем по количеству и дате и убавим на количество сверх заказа
					ОтборСтрокЗаказа = Новый Структура();
					ОтборСтрокЗаказа.Вставить("Номенклатура",СтрокаТЧ.Номенклатура);
					ОтборСтрокЗаказа.Вставить("Характеристика",СтрокаТЧ.Характеристика);
					ОтборСтрокЗаказа.Вставить("Отменено",Ложь);
					
					МассивСтрокЗаказа = ЭтотОбъект.Товары.НайтиСтроки(ОтборСтрокЗаказа);
					Если не МассивСтрокЗаказа.Количество() = 0 Тогда
						
						ТЗ_ДляСортировки = Новый ТаблицаЗначений;
						ТЗ_ДляСортировки.Колонки.Добавить("НомерСтроки");
						ТЗ_ДляСортировки.Колонки.Добавить("Номенклатура");
						ТЗ_ДляСортировки.Колонки.Добавить("Характеристика");
						ТЗ_ДляСортировки.Колонки.Добавить("НачалоОтгрузки");
						ТЗ_ДляСортировки.Колонки.Добавить("КоличествоУпаковок");
						
						Для каждого СтрокаМассиваТоваров Из МассивСтрокЗаказа Цикл
							Если СтрокаМассиваТоваров.Назначение.Заказ = НайденныйЭтап.НазначениеЗаказ Тогда
								НовСтрТЗ = ТЗ_ДляСортировки.Добавить();
								НовСтрТЗ.НомерСтроки = СтрокаМассиваТоваров.НомерСтроки;
								НовСтрТЗ.Номенклатура = СтрокаМассиваТоваров.Номенклатура;
								НовСтрТЗ.Характеристика = СтрокаМассиваТоваров.Характеристика;
								НовСтрТЗ.НачалоОтгрузки = СтрокаМассиваТоваров.НачалоОтгрузки;
								НовСтрТЗ.КоличествоУпаковок = СтрокаМассиваТоваров.КоличествоУпаковок;
							КонецЕсли;
						КонецЦикла;
						
						ТЗ_ДляСортировки.Сортировать("НачалоОтгрузки");
						
						Для каждого СтрокаТЗ_ДляСортировки Из ТЗ_ДляСортировки Цикл
							Если СтрокаТЗ_ДляСортировки.КоличествоУпаковок > Количество Тогда
								СтрокаДляУменьшения = ЭтотОбъект.Товары.Найти(СтрокаТЗ_ДляСортировки.НомерСтроки,"НомерСтроки");
								СтрокаДляУменьшения.КоличествоУпаковок = СтрокаДляУменьшения.КоличествоУпаковок - Количество;
								СтрокаДляУменьшения.Количество = СтрокаДляУменьшения.Количество - Количество;
								Прервать;
							ИначеЕсли СтрокаТЗ_ДляСортировки.КоличествоУпаковок = Количество Тогда
								СтрокаДляУменьшения = ЭтотОбъект.Товары.Найти(СтрокаТЗ_ДляСортировки.НомерСтроки,"НомерСтроки");
	                            ЭтотОбъект.Товары.Удалить(СтрокаТЗ_ДляСортировки.НомерСтроки-1);
								Прервать;							
							КонецЕсли;
						КонецЦикла;						
						
					КонецЕсли;
					//
					
				КонецЕсли;
				
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры
